tap 'caskroom/cask'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'homebrew/completions'



brew 'bash-completion'
brew 'completions'
brew 'git'
brew 'git-extras'
brew 'libsass'
brew 'libxml2'
brew 'node'
brew 'wget'
brew 'mas'
brew 'tree'
brew 'openssl'
brew 'ssh-copy-id'

cask 'firefox'
cask 'google-chrome'
cask 'google-drive'
cask 'java'
cask 'skype'
cask 'spotify'
cask 'zeplin'
# cask 'macvim'
cask 'slack'

# # install appstore apps
# echo "💿 Amphetamine" && mas install 937984704
# echo "💿 Capto" && mas install 1078184147
# echo "💿 ColorSnapper2" && mas install 969418666
# echo "💿 Converto - The Unit Converter" && mas install 576421334
# echo "💿 DaisyDisk" && mas install 411643860
# echo "💿 Dash 3" && mas install 449589707
# echo "💿 Fantastical 2" && mas install 975937182
# echo "💿 Hyper 3" && mas install 685096913
# echo "💿 iMovie" && mas install 408981434
# echo "💿 Kaleidoscope" && mas install 587512244
echo "💿 Divvy" && mas install 413857545
echo "💿 Keynote" && mas install 409183694
echo "💿 LastPass" && mas install 926036361
echo "💿 Rar" && mas install 646295438
echo "💿 xcode" && mas install 497799835
# echo "💿 Marboo Pro" && mas install 1010557319
# echo "💿 Numbers" && mas install 409203825
# echo "💿 Pages" && mas install 409201541
# echo "💿 Patterns - The Regex App" && mas install 429449079
# echo "💿 Pixelmator" && mas install 407963104
# echo "💿 Transmit" && mas install 403388562



# # Update homebrew
# brew install bash-completion git
# brew update
# brew upgrade

# # install homebrew cask
# brew tap caskroom/cask

# # install homebrew bash-completion
# brew tap homebrew/completions

# # install mas
# brew install mas

# # install essentials
# brew install \
# aria2 \
# autoconf \
# automake \
# colordiff \
# direnv \
# docker-completion \
# docker-compose-completion \
# exiftool \
# graphicsmagick \
# imagemagick \
# jpegoptim \
# openssl \
# packer \
# packer-completion \
# pip-completion \
# pngcrush \
# sqlite \
# ssh-copy-id \
# terraform \
# the_platinum_searcher \
# tree \
# wget \
# z \
# zopfli \


# # install "out of appstore" apps
# brew cask install \
# atom \
# droplr \
# firefox \
# github-desktop \
# google-chrome \
# google-drive \
# hammerspoon \
# iterm2 \
# kodi \
# macvim \
# microsoft-office \
# netspot \
# notational-velocity \
# sketch \
# slack \
# spotify \
# the-unarchiver \
# transmission \
# vlc \
# winbox \

# # install appstore apps
# echo "💿 Amphetamine" && mas install 937984704
# echo "💿 Capto" && mas install 1078184147
# echo "💿 ColorSnapper2" && mas install 969418666
# echo "💿 Converto - The Unit Converter" && mas install 576421334
# echo "💿 DaisyDisk" && mas install 411643860
# echo "💿 Dash 3" && mas install 449589707
# echo "💿 Fantastical 2" && mas install 975937182
# echo "💿 Hyper 3" && mas install 685096913
# echo "💿 iMovie" && mas install 408981434
# echo "💿 Kaleidoscope" && mas install 587512244
# echo "💿 Keynote" && mas install 409183694
# echo "💿 LastPass" && mas install 926036361
# echo "💿 Marboo Pro" && mas install 1010557319
# echo "💿 Numbers" && mas install 409203825
# echo "💿 Pages" && mas install 409201541
# echo "💿 Patterns - The Regex App" && mas install 429449079
# echo "💿 Pixelmator" && mas install 407963104
# echo "💿 Transmit" && mas install 403388562

# # install sshfs
# brew cask install sshfs

# # install python
# brew install \
# pyenv \
# pyenv-virtualenv

# # install ruby
# brew install chruby ruby-install
# ruby-install ruby --no-reinstall
# brew install --HEAD https://raw.github.com/postmodern/gem_home/master/homebrew/gem_home.rb

# # install java
# brew cask install java

# brew install \
# ant \
# maven \
# maven-completion \
# gradle \
# selenium-server-standalone \

# # install android
# brew install \
# android-sdk \
# android-ndk \
# gradle \
# exiftool \

# brew cask install \
# xquartz \
# inkscape \

# # install scala
# brew install \
# scala \
# sbt \

# # install node
# brew install node

# # install go
# brew install go